app/Controllers/Profil.php

    public function layanan()
    {
        $layananModel = new LayananModel();
        $data['layanan'] = $layananModel->findAll();
---
SELECT *
FROM `layanan`